In [1]:
%matplotlib inline
import pandas as pd

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
rel=pd.read_csv("release_dates.csv")
rel.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### How many movies are listed in the titles dataframe?

In [6]:
print("Total number of movies listed in the dataframes are:")
len(titles)

Total number movies listed in the dataframe are:

244914

### What are the earliest two films listed in the titles dataframe?

In [9]:
titles.sort_values(by=['year']).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [10]:
print("Total number of movies with title Hamlet are:")
len(titles[titles['title']=='Hamlet'])

Total number of movies with title Hamlet are:

20

### How many movies are titled "North by Northwest"?

In [11]:
print("Total number of movies with title North by Northwest are:")
len(titles[titles['title']=='North by Northwest'])

Total number of movies with title North by Northwest are:

1

### When was the first movie titled "Hamlet" made?

In [77]:
print("The first movie titled Hamlet was made in year:")
titles[titles['title']=='Hamlet'].sort_values(by=['year']).head(1).year

The first movie titled Hamlet was made in year:

52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [14]:
print("List of all Treasure Island movies form earliest to most recent are:")
titles[titles['title']=='Treasure Island'].sort_values(by=['year'])

List of all Treasure Island movies form earliest to most recent are:

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [15]:
print("Total number of movies made in the year 1950 are:")
len(titles[titles['year']==1950])

Total number of movies made in the year 1950 are:

1113

### How many movies were made in the year 1960?

In [17]:
print("Total number of movies made in the year 1960 are:")
len(titles[titles['year']==1960])

Total number of movies made in the year 1960 are:

1549

### How many movies were made from 1950 through 1959?

In [18]:
print("Total number of movies made from 1950 to 1959 are:")
len(titles[(titles['year']>=1950)&(titles['year']<=1959)])

Total number of movies made from 1950 to 1959 are:

12934

### In what years has a movie titled "Batman" been released?

In [19]:
print("The years in which movie titled Batman has been released are:")
(titles[titles['title']=='Batman']).year

The years in which movie titled Batman has been released are:

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [73]:
print("The number of roles in the movie Inception are:")
print(len(cast[cast['title']=='Inception'].type))
cast[cast['title']=='Inception'].head()

The number of roles in the movie Inception are:
78

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [72]:
print("The number of roles in the movie Inception not ranked by n value are:")
print(len(cast[(cast['title']=='Inception')&(cast['n'].isnull()==True)].type))
cast[(cast['title']=='Inception')&(cast['n'].isnull()==True)].head()

The number of roles in the movie Inception not ranked by n value are:
27

            title  year                  name   type         character   n
98153   Inception  2010  Michael (III) August  actor     LAX Passenger NaN
197877  Inception  2010              Ken Bhan  actor  Mombasan Gambler NaN
374661  Inception  2010         John Ceallach  actor     LAX Passenger NaN
497161  Inception  2010          Garvin Cross  actor    Snow Commander NaN
684098  Inception  2010         Seve Esposito  actor   Italian Gambler NaN

### But how many roles in the movie "Inception" did receive an "n" value?

In [71]:
print("The number of roles in the movie Inception with n value are:")
print(len(cast[(cast['title']=='Inception')&(cast['n'].isnull()==False)].type))
cast[(cast['title']=='Inception')&(cast['n'].isnull()==False)].head()

The number of roles in the movie Inception with n value are:
51

            title  year            name   type              character     n
149008  Inception  2010    Peter Basham  actor  Fischer's Jet Captain  44.0
183937  Inception  2010    Tom Berenger  actor               Browning   8.0
260128  Inception  2010  Virgile Bramly  actor         Bridge Sub Con  29.0
326745  Inception  2010   Michael Caine  actor                  Miles  11.0
333415  Inception  2010    Earl Cameron  actor       Elderly Bald Man  20.0

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [70]:
print("The cast of North by Northwest in their correct n-value order value with n values are:")
print(cast[(cast['title']=="North by Northwest")&(cast['n'].isnull()==False)].sort_values(by=['n']).name)
cast[(cast['title']=="North by Northwest")&(cast['n'].isnull()==False)].sort_values(by=['n'])

The cast of North by Northwest in their correct n-value order value with n values are:
871426               Cary Grant
3518333         Eva Marie Saint
1457165             James Mason
3157232     Jessie Royce Landis
356707           Leo G. Carroll
3048272    Josephine Hutchinson
1695173             Philip Ober
1275337           Martin Landau
2447081           Adam Williams
1811387            Edward Platt
665768        Robert Ellenstein
2295714            Les Tremayne
464736          Philip Coolidge
1508344           Patrick McVey
206471             Edward Binns
1384780               Ken Lynch
Name: name, dtype: object

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [69]:
print("The entire cast of 1972 film Seluth order by n value is:")
print((cast[(cast['title']=="Sleuth")&(cast['year']==1972)]).sort_values(by=['n']).name)
cast[(cast['title']=="Sleuth")&(cast['year']==1972)].sort_values(by=['n'])

The entire cast of 1972 film Seluth order by n value is:
1705394      Laurence Olivier
326773          Michael Caine
373876         Alec Cawthorne
1465483    John (II) Matthews
2724553    Eve (III) Channing
1448690          Teddy Martin
Name: name, dtype: object

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [68]:
print("The entire cast of 2007 film Seluth order by n value is:")
print(cast[(cast['title']=="Sleuth")&(cast['year']==2007)].sort_values(by=['n']).name)
cast[(cast['title']=="Sleuth")&(cast['year']==2007)].sort_values(by=['n'])

The entire cast of 2007 film Seluth order by n value is:
326774           Michael Caine
1293634               Jude Law
1805907          Harold Pinter
260242         Kenneth Branagh
373877     Alec (II) Cawthorne
2724552      Eve (II) Channing
3370424      Carmel O'Sullivan
Name: name, dtype: object

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [67]:
print("The number of roles that were credited in the silent 1921 version of Hamlet are:")
print(len(cast[(cast['title']=='Hamlet')&(cast['year']==1921)]))
cast[(cast['title']=='Hamlet')&(cast['year']==1921)].head()

The number of roles that were credited in the silent 1921 version of Hamlet are:
9

          title  year              name   type     character    n
7789     Hamlet  1921  Fritz Achterberg  actor   Fortinbras,  9.0
458904   Hamlet  1921      Paul Conradi  actor  K?nig Hamlet  2.0
555034   Hamlet  1921  Anton De Verdier  actor       Laertes  7.0
1135279  Hamlet  1921   Hans Junkermann  actor      Polonius  6.0
2185558  Hamlet  1921      Heinz Stieda  actor       Horatio  5.0

### How many roles were credited in Branagh’s 1996 Hamlet?

In [66]:
print("The number of roles that were credited in the Branagh's 1996 Hamlet are:")
print(len(cast[(cast['title']=='Hamlet')&(cast['year']==1996)]))
cast[(cast['title']=='Hamlet')&(cast['year']==1996)].head()

The number of roles that were credited in the Branagh's 1996 Hamlet are:
54

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0

### How many "Hamlet" roles have been listed in all film credits through history?

In [65]:
print("The number of Hamlet roles that have been listed in all film credits throughout the history are:")
print(len(cast[(cast['title']=='Hamlet')]))
cast[(cast['title']=='Hamlet')].head()

The number of Hamlet roles that have been listed in all film credits throughout the history are:
342

        title  year              name   type              character     n
1731   Hamlet  1996        Riz Abbasi  actor  Attendant to Claudius   1.0
7789   Hamlet  1921  Fritz Achterberg  actor            Fortinbras,   9.0
11728  Hamlet  2009      Hayden Adams  actor                Laertes   7.0
11729  Hamlet  2009      Hayden Adams  actor                 Player   7.0
14493  Hamlet  1913       Eric Adeney  actor               Reynaldo  14.0

### How many people have played an "Ophelia"?

In [62]:
print("The number of people who played Ophelia are:")
print(len(cast[cast['character']=='Ophelia']))
cast[cast['character']=='Ophelia'].name.head()

The number of people who played Ophelia are:
117

248251             Amy Bourque
410247          Josie Chisholm
470859         Crystal Cordero
866334           Lucas Grabeel
1364457    Catherine (IV) Lord
Name: name, dtype: object

### How many people have played a role called "The Dude"?

In [63]:
print("The number of people who played The Dude are:")
print(len(cast[cast['character']=='The Dude']))
cast[cast['character']=='The Dude'].name.head()

The number of people who played The Dude are:
19

272161      Jeff Bridges
339389       Jordan Cann
498660     Scott Crowell
570128    Chris DeMarcus
610791       Mike Donlin
Name: name, dtype: object

### How many people have played a role called "The Stranger"?

In [64]:
print("The number of people who played The Stranger are:")
print(len(cast[cast['character']=='The Stranger']))
cast[cast['character']=='The Stranger'].name.head()

The number of people who played The Stranger are:
212

25954    Hassan Mutlag Al-Maraiyeh
35748         Vincent H. Alexander
46418                 Terral Altom
67421                 Tony Anthony
67424                 Tony Anthony
Name: name, dtype: object

### How many roles has Sidney Poitier played throughout his career?

In [80]:
print("The number of roles played by Sidney Poitier throughout his career are:")
print(len(cast[cast['name']=='Sidney Poitier']))
cast[cast['name']=='Sidney Poitier'].head()

The number of roles played by Sidney Poitier throughout his career are:
43

,title,year,name,type,character,n
1816209,A Patch of Blue,1965,Sidney Poitier,actor,Gordon Ralfe,1.0
1816210,A Piece of the Action,1977,Sidney Poitier,actor,Manny Durrell,1.0
1816211,A Raisin in the Sun,1961,Sidney Poitier,actor,Walter Lee Younger,1.0
1816212,A Warm December,1973,Sidney Poitier,actor,Dr. Matt Younger,1.0
1816213,All the Young Men,1960,Sidney Poitier,actor,Sgt. Eddie Towler,2.0

### How many roles has Judi Dench played?

In [79]:
print("The number of roles played by Judi Dench are:")
print(len(cast[cast['name']=='Judi Dench']))
cast[cast['name']=='Judi Dench'].head()

The number of roles played by Judi Dench are:
55

,title,year,name,type,character,n
2814206,84 Charing Cross Road,1987,Judi Dench,actress,Nora Doel,3.0
2814207,A Handful of Dust,1988,Judi Dench,actress,Mrs. Beaver,13.0
2814208,A Midsummer Night's Dream,1968,Judi Dench,actress,Titania,16.0
2814209,A Room with a View,1985,Judi Dench,actress,"Eleanor Lavish, a novelist",7.0
2814210,A Study in Terror,1965,Judi Dench,actress,Sally,8.0

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [55]:
print(" In 1940's, The list of supporting roles played by Cary Grant, ordered by year are:")
cast[(cast['name']=='Cary Grant')&(cast['n']==2)&(cast['year']>=1940)&(cast['year']<=1949)].sort_values(by=['year'])

 In 1940's, The list of supporting roles played by Cary Grant, ordered by year are:

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [54]:
print(" In the 1940s, The leading roles that Cary Grant played by year are:")
cast[(cast['name']=='Cary Grant')&(cast['n']==1)&(cast['year']>=1940)&(cast['year']<=1949)].sort_values(by=['year'])

 In the 1940s, The leading roles that Cary Grant played by year are:

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [78]:
print("In 1950s, The number of roles available for actors in 1950s are:")
print(len(cast[(cast['year']>=1950)&(cast['year']<=1959)&(cast['type']=='actor')].type))

In 1950s, The number of roles available for actors in 1950s are:
157738

### How many roles were available for actresses in the 1950s?

In [45]:
print("In 1950s, The number of roles available for actresses are:")
print(len(cast[(cast['year']>=1950)&(cast['year']<=1959)&(cast['type']=='actress')].type))

In 1950s, The number of roles available for actresses are:
57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [44]:
print("Through 1980, The number of leading roles available from the beginning of film history are:")
print(len(cast[(cast['year']<=1980)&(cast['n']==1)].type))

Through 1980, The number of leading roles available from the beginning of film history are:
65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [46]:
print("Through 1980, The number of non-leading roles available from the beginning of film history are:")
print(len(cast[(cast['year']<=1980)&(cast['n']!=1)].type))

Through 1980, The number of non-leading roles available from the beginning of film history are:
1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [42]:
print("The number of roles through 1980 that were minor enough that they did not warrant a numeric n rank are:")
print(len(cast[(cast['year']==1980)&(cast['n'].isnull()==True)]))

The number of roles through 1980 that were minor enough and did not warrant a numeric n rank are:
4466